In [1]:
%load_ext sql

In [2]:
import mysql.connector

# Establish a connection to your MySQL server

conn=mysql.connector.connect(host='localhost',user='root',password='redhat',database='mydb')

# Create a cursor to interact with the database
cursor = conn.cursor()

# Define the CREATE TABLE query
create_table_query = """
CREATE TABLE Emp (
    EmployeeID INT PRIMARY KEY,
    Name VARCHAR(50),
    ManagerID INT
);
"""

# Define the INSERT INTO query
insert_data_query = """
INSERT INTO Emp (EmployeeID, Name, ManagerID)
VALUES
    (101, "Pankaj", NULL),
    (102, 'Rahul', 104),
    (103, 'Aarti', 103),
    (104, 'Vikas', 102),
    (105, 'Raj', 101);
"""

# Execute the CREATE TABLE query
cursor.execute(create_table_query)

# Execute the INSERT INTO query
cursor.execute(insert_data_query)

# Commit the changes and close the cursor and connection
conn.commit()
cursor.close()
conn.close()

print("Table created successfully")

Table created successfully

In [4]:
%%sql mysql://root:redhat@localhost:3306/mydb
select * from emp;

5 rows affected.

[(101, 'Pankaj', None),
 (102, 'Rahul', 104),
 (103, 'Aarti', 103),
 (104, 'Vikas', 102),
 (105, 'Raj', 101)]